In [2]:
import pandas as pd

In [3]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv"

In [4]:
dataset = pd.read_csv(url, sep='\t')

In [5]:
dataset.shape

(4622, 5)

# Number of observations in the dataset

In [7]:
dataset.shape[0]

4622

In [9]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

# First 10 entries

In [38]:
dataset.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

# Number of columns in the dataset

In [11]:
dataset.shape[1]

5

In [10]:
dataset.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [41]:
dataset.index

RangeIndex(start=0, stop=4622, step=1)

# Which was the most-ordered item?

In [68]:
c = dataset.groupby('item_name')['quantity'].sum().sort_values(ascending=False)
c.head(1)

item_name
Chicken Bowl    761
Name: quantity, dtype: int64

In [69]:
dataset.groupby('item_name')['quantity'].sum().idxmax()

'Chicken Bowl'

#  For the most-ordered item, how many items were ordered?

In [70]:
most_ordered_item = c.index[0]
total_quantity = c.iloc[0]
print(most_ordered_item)
print(total_quantity)

Chicken Bowl
761

# What was the most ordered item in the choice_description column?

In [73]:
dataset.groupby('choice_description')['quantity'].sum().idxmax()

'[Diet Coke]'

In [12]:
cd = dataset.groupby('choice_description')['quantity'].sum().sort_values(ascending=False)
most_choice_description_item = cd.index[0]
total_quantity = cd.iloc[0]
print(most_choice_description_item)
print(total_quantity)

[Diet Coke]
159

# How many items were orderd in total?

In [81]:
total_items_orders = dataset.quantity.sum()
print(total_items_orders)

4972

In [47]:
dataset.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [48]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

# Turn the item price into a float

# Using Lambda and apply

In [51]:
dataset['item_price'].apply(lambda x: float(x.replace('$', '')))

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: float64

In [16]:
dataset['item_price'] = dataset['item_price'].str.replace('$', '').astype(float)

In [53]:
dataset.head(4)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39

In [54]:
dataset['item_price'].dtypes

dtype('float64')

# How much was the revenue for the period in the dataset?

In [23]:
revenue = (dataset['item_price'] * dataset['quantity']).sum()
print('Revenue was: $' + str(revenue))

Revenue was: $39237.02

In [17]:
# dataset['revenue'] = dataset['item_price']*dataset['quantity']
# dataset['revenue'].sum()

39237.02

# How many orders were made in the period?

In [27]:
dataset['order_id'].value_counts()

926     23
1483    14
205     12
691     11
1786    11
        ..
105      1
702      1
718      1
568      1
800      1
Name: order_id, Length: 1834, dtype: int64

In [30]:
# How many unique orders exist?
dataset['order_id'].value_counts().count()

1834

In [31]:
dataset['order_id'].nunique()

1834

# What is the average revenue amount per order?

In [36]:
dataset.groupby('order_id')['revenue'].sum().mean()

21.39423118865867

In [37]:
ordered_group = dataset.groupby('order_id').sum()
ordered_group

          quantity  item_price  revenue
order_id
1                4       11.56    11.56
2                2       16.98    33.96
3                2       12.67    12.67
4                2       21.00    21.00
5                2       13.70    13.70
...            ...         ...      ...
1830             2       23.00    23.00
1831             3       12.90    12.90
1832             2       13.20    13.20
1833             2       23.50    23.50
1834             3       28.75    28.75

[1834 rows x 3 columns]

In [38]:
ordered_group['revenue'].mean()

21.39423118865867

In [40]:
ordered_group.mean()['revenue']

21.39423118865867